app/views/sliders/destroy.js.erb

$('.delete_slider').bind('ajax:success', function() {
	$(".rowForm").remove();
	$(this).closest('tr').fadeOut();
});
---
DELETE FROM `sliders` WHERE `sliders`.`id` = 10