app/controllers/collections_controller.rb

  def show
    @collection.images = @collection.images.all
---
SELECT `images`.* FROM `images` WHERE `images`.`collection_id` = 3

  def create
    @collections = Collection.all.joins(:post).order("posts.release_date desc")
    @collection = Collection.new(collection_params)
    respond_to do |format|
      if @collection.save
---
SELECT `collections`.* FROM `collections` INNER JOIN `posts` ON `posts`.`id` = `collections`.`post_id` ORDER BY posts.release_date desc
INSERT INTO `collections` (`post_id`, `title`, `subtitle`, `cover_file_name`, `cover_content_type`, `cover_file_size`, `cover_updated_at`, `created_at`, `updated_at`) VALUES (7, 'Cafetería de Luces', 'Kahli', '1.1.jpg', 'image/jpeg', 875968, '2017-08-21 19:11:57', '2017-08-21 19:11:58', '2017-08-21 19:11:58')

  def update
    @collections = Collection.all.joins(:post).order("posts.release_date desc")
    respond_to do |format|
      if @collection.update(collection_params)
---
SELECT `collections`.* FROM `collections` INNER JOIN `posts` ON `posts`.`id` = `collections`.`post_id` ORDER BY posts.release_date desc
UPDATE `collections` SET `cover_file_name` = 'slider1.jpg', `cover_content_type` = 'image/jpeg', `cover_file_size` = 168794, `cover_updated_at` = '2017-07-09 21:10:57', `updated_at` = '2017-07-09 21:10:58' WHERE `collections`.`id` = 1

    def set_collection
      @collection = Collection.find(params[:id])
---
SELECT  `collections`.* FROM `collections` WHERE `collections`.`id` = 3 LIMIT 1