app/controllers/contents_controller.rb

  def create
    @content = Content.new(content_params)
    @content.post = @post
    respond_to do |format|
      if @content.save
---
INSERT INTO `contents` (`index`, `created_at`, `updated_at`, `style`, `post_id`) VALUES (2, '2017-08-24 03:58:21', '2017-08-24 03:58:21', 'Image', 7)

  def update
    respond_to do |format|
      if @content.update(content_params)
---
UPDATE `contents` SET `index` = 1, `title` = '', `body` = '&nbsp&nbsp&nbsp&nbsp&nbsp Existen espacios que logran hacernos vivir sensaciones únicas, donde simplemente no encontramos una razón específica para explicarlo, solo sentimos como fluyen una serie de variables que nos permiten ser protagonistas de todo un conjunto de experiencias.\r\n<br>\r\n<br>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp En San Isidro de Heredia se encuentra una Cafetería Boutique y Bistró con gran personalidad a cargo de la Chef Sophia Rodríguez junto con su equipo de trabajo, resultado de la fusión de personas apasionadas tanto por la buena gastronomía como por el Café de especialidad Brumas del Zurquí, y pues sí, este es uno de esos lugares que nos trasmite un sinfín de sensaciones desde el momento que ingresamos. \r\n', `updated_at` = '2017-08-24 03:37:43' WHERE `contents`.`id` = 1

    def set_post
      @post = Post.find(params[:post_id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1