app/controllers/images_controller.rb

  def create
    @image = Image.new(image_params)
    @image.collection = @collection
    respond_to do |format|
      if @image.save
---
INSERT INTO `images` (`collection_id`, `content_file_name`, `content_content_type`, `content_file_size`, `content_updated_at`, `created_at`, `updated_at`) VALUES (3, '1.1.jpg', 'image/jpeg', 875968, '2017-08-21 19:25:26', '2017-08-21 19:25:27', '2017-08-21 19:25:27')

    def set_collection
      @collection = Collection.find(params[:collection_id])
---
SELECT  `collections`.* FROM `collections` WHERE `collections`.`id` = 3 LIMIT 1