app/controllers/index_controller.rb

  def home
  	@sliders = Slider.all.order(:index)
  	@posts = Post.all.where("release_date <= ?", Date.today).order(release_date: :desc).limit(9)
  	@collections = Collection.all.joins(:post).where("posts.release_date <= ?", Date.today).order("posts.release_date desc").limit(6)
---
SELECT `sliders`.* FROM `sliders` ORDER BY `sliders`.`index` ASC
SELECT  `posts`.* FROM `posts` WHERE (release_date <= '2017-08-21') ORDER BY `posts`.`release_date` DESC LIMIT 9
SELECT  `collections`.* FROM `collections` INNER JOIN `posts` ON `posts`.`id` = `collections`.`post_id` WHERE (posts.release_date <= '2017-08-21') ORDER BY posts.release_date desc LIMIT 6

  def blog
  	@posts = Post.all.where("release_date <= ?", Date.today).order(release_date: :desc)
---
SELECT `posts`.* FROM `posts` WHERE (release_date <= '2017-08-20') ORDER BY `posts`.`release_date` DESC

  def gallery
  	@collections = Collection.all.joins(:post).where("posts.release_date <= ?", Date.today).order("posts.release_date desc")
---
SELECT `collections`.* FROM `collections` INNER JOIN `posts` ON `posts`.`id` = `collections`.`post_id` WHERE (posts.release_date <= '2017-08-20') ORDER BY posts.release_date desc

  def about
    @pictures = Picture.all
---
SELECT `pictures`.* FROM `pictures`