app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(release_date: :desc)
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`release_date` DESC

  def show
    @post.contents = @post.contents.all.order(:index)
    @collection = Collection.find_by_post_id(@post.id)
---
SELECT `contents`.* FROM `contents` WHERE `contents`.`post_id` = 7 ORDER BY `contents`.`index` ASC
SELECT  `collections`.* FROM `collections` WHERE `collections`.`post_id` = 7 LIMIT 1

  def create
    @posts = Post.all.order(release_date: :desc)
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`release_date` DESC
INSERT INTO `posts` (`title`, `subtitle`, `release_date`, `cover_file_name`, `cover_content_type`, `cover_file_size`, `cover_updated_at`, `created_at`, `updated_at`, `author`) VALUES ('Cafeteria de Colores', 'Kahli', '2017-08-21', '6.jpg', 'image/jpeg', 1278436, '2017-08-21 19:11:10', '2017-08-21 19:11:10', '2017-08-21 19:11:10', 'Juan')

  def update
    @posts = Post.all.order(release_date: :desc)
    respond_to do |format|
      if @post.update(post_params)
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`release_date` DESC
UPDATE `posts` SET `cover_file_name` = 'slider4.jpg', `cover_content_type` = 'image/jpeg', `cover_file_size` = 559991, `cover_updated_at` = '2017-07-09 20:07:37', `updated_at` = '2017-07-09 20:07:38' WHERE `posts`.`id` = 3