app/controllers/sliders_controller.rb

  def create
    @sliders = Slider.all
    @slider = Slider.new(slider_params)
    respond_to do |format|
      if @slider.save
---
INSERT INTO `sliders` (`title`, `subtitle`, `url`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `created_at`, `updated_at`, `index`) VALUES ('Cafeteria de Colores', 'Cafeteria de Colores', 'Cafeteria de Colores', 'WhatsApp_Image_2017-08-19_at_5.33.00_PM.jpeg', 'image/jpeg', 211209, '2017-08-21 19:10:03', '2017-08-21 19:10:06', '2017-08-21 19:10:06', 1)

  def update
    @sliders = Slider.all
    respond_to do |format|
      if @slider.update(slider_params)
---
UPDATE `sliders` SET `title` = 'Caffora Coffe Blog', `subtitle` = 'Una Nueva Experiencia de Vivir el Café', `url` = '', `updated_at` = '2017-08-25 04:02:38' WHERE `sliders`.`id` = 9

  def destroy
    @slider.destroy
---
DELETE FROM `sliders` WHERE `sliders`.`id` = 10