app/views/images/_table.html.erb

SELECT `images`.* FROM `images` WHERE `images`.`collection_id` = 3
---
    <div class="image_container slider-for">
        <% @collection.images.each do |image| %>